Merge pull request #1 from dyshay/feat/phase-3-pomi
Feat/phase 3 pomi
